Revit API Introduction Labs
Lab2_4_EditFamilyInstance Class
 Demonstrate access to family instance parameters and modification of family instance location. Edit all doors in the current project. Move the doors up 0.2 feet via the Document.Move method and widen them 1 foot by changing the WINDOW_WIDTH parameter value.
 In this lab, we select all doors in current document, move them up by 0.2 feet via the Document.Move method and widen them by one foot by changing the WINDOW_WIDTH parameter value.
 Add a new command named Lab2_4_EditFamilyInstance to the Labs2 module. Retrieve all doors in the current document using a filtered collector like in the previous lab, either explicitly instantiating it and asking for the appropriate category and System.Type, or using one of the LabUtils methods such as GetElementsOfType or (most efficiently) GetFamilyInstances.
 Go through the returned elements and move each door up using the Document.Move method. Increasing the door width can be achieved by changing the value of the built-in parameter WINDOW_WIDTH. Note that this parameter is on the door symbol, i.,e a type parameter. What happens if there are many doors in the model? In what way does this behaviour depend on the regeneration option?
 Since this command modifies the database, we need to return a Succeeded result code or the changes will be discarded.
CopyC#
FilteredElementCollector doors = LabUtils.GetFamilyInstances(
  doc, BuiltInCategory.OST_Doors );
// move doors up 0.2 feet:
XYZ v = 0.2 * XYZ.BasisZ;
foreach( FamilyInstance door in doors )
{
  doc.Move( door, v );
  // widen doors by one foot by changing parameter value:
  Parameter p = door.Symbol.get_Parameter(
    BuiltInParameter.WINDOW_WIDTH );
  if( null != p )
  {
    double width = p.AsDouble();
    width += 1.0;
    p.Set( width );
  }
}
return Result.Succeeded;
CopyVB.NET
Dim doors As FilteredElementCollector _
    = LabUtils.GetFamilyInstances(doc, BuiltInCategory.OST_Doors)
' move doors up 0.2 feet:
Dim v As XYZ = 0.2 * XYZ.BasisZ
For Each door As FamilyInstance In doors
    doc.Move(door, v)
    ' widen doors by one foot by changing parameter value:
    Dim p As Parameter = door.Symbol.Parameter(BuiltInParameter.WINDOW_WIDTH)
    If p IsNot Nothing Then
        Dim width As Double = p.AsDouble()
        width += 1
        p.Set(width)
    End If
Next
Return Result.Succeeded
 Before running the command, please ensure that there is at least one door in the model.
 Namespace: Labs
 Assembly: labs (in labs.dll) Version: 3.0.0.1 (3.0.0.1)
Syntax
C#
public class Lab2_4_EditFamilyInstance : IExternalCommand
Visual Basic (Declaration)
Public Class Lab2_4_EditFamilyInstance _
	Implements IExternalCommand
Visual C++
public ref class Lab2_4_EditFamilyInstance : IExternalCommand
Inheritance Hierarchy
System.Object
 Labs.Lab2_4_EditFamilyInstance
See Also
Lab2_4_EditFamilyInstance Members
Labs Namespace